Revit 2024 API
FabricArea.FabricLocation Property
 The Fabric location in the host.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public FabricLocation FabricLocation { get; set; }
Visual Basic
Public Property FabricLocation As FabricLocation
	Get
	Set
Visual C++
public:
property FabricLocation FabricLocation {
	FabricLocation get ();
	void set (FabricLocation value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace